[
    {
      "id": 1,
      "title": "HACK THE LADDER",
      "description": "Climb your way to the top by solving complex coding challenges. Compete against the best and prove your skills in this ultimate coding battle!",
      "image": "src/assets/code the leder.png"
    },
    {
      "id": 2,
      "title": "BUG HUNT",
      "description": "Think like a tester, debug like a pro! Find and fix hidden errors in the given code within a time limit. The one who catches the most bugs wins!",
      "image": "src/assets/bug hunt.png"
    },
    {
      "id": 3,
      "title": "NETWORKING",
      "description": "Show off your networking knowledge! Solve real-world networking problems, design secure architectures, and prove you're the networking expert!",
      "image": "src/assets/networking.png"
    },
    {
      "id": 4,
      "title": "CODECRAZE",
      "description": "A thrilling coding competition where logic meets creativity. Solve algorithmic puzzles, optimize your code, and challenge your limits!",
      "image": "src/assets/codecraze.png"
    },
    {
      "id": 5,
      "title": "TECH BLAST",
      "description": "A rapid-fire quiz that tests your knowledge of emerging technologies, groundbreaking innovations, and futuristic trends. Stay sharp and get ready to blast through a series of challenging tech questions!",
      "image": "src/assets/tech blast.png"
    },
    {
      "id": 6,
      "title": "TECH O TECH",
      "description": "Step into a world filled with cutting-edge technology! This event brings you hands-on experience with the latest gadgets, software, and AI-driven solutions. Dive deep into the tech revolution!    ",
      "image": "src/assets/tech o tech.png"
    },
    {
      "id": 7,
      "title": "PICK THE BID",
      "description": "A thrilling auction-style event where participants bid on tech-related products, innovations, and concepts. Use your analytical skills and strategy to make the smartest bids and win big!",
      "image": "src/assets/pick the bid.png"
    },
    {
      "id": 8,
      "title": "TECH DEBATE",
      "description": "A high-intensity debate where participants tackle the most pressing tech-related controversies. AI ethics, cybersecurity, blockchain – get ready to voice your opinions and challenge the competition!",
      "image": "src/assets/debate.png"
    }
    
  ]
  